{"data":[{"id":53,"name":"Kelz Serendipity","user_ip":"197.1.245.2","content":"Happy Birthday to you Pastor Gregory and many more wonderful beautiful blessed years to u and urs! Inshallah 🙏","created_at":"2025-07-27 08:51:16","created_diff":"1 month ago"},{"id":51,"name":"Philips Akinwole","user_ip":"104.28.103.14","content":"Happy birthday sir. Thank you for allowing yourself to be a spokesman for God. You’re a father and mentor filled with GOD'S revelational wisdom. May the GOOD GOD continue to bless you with more wisdom and multiply His anointing over your life. Thank you.","created_at":"2025-07-27 00:30:12","created_diff":"1 month ago"},{"id":50,"name":"Oluwadamilola ODEYEMI","user_ip":"197.211.63.79","content":"Happy birthday to you sir dear Prof G.E. Erhabor.\n\nIt is with great pleasure that I join others to celebrate you on this auspicious occasion of your birthday. I appreciate you sir for being a blessing to me and to countless others. I thank you for how you have impacted my life positively. Thank you for all you have done and all that you continue to do. I pray that the Almighty God will satisfy you with good health, long life and prosperity. May you never know a better yesterday. Once again, happy birthday to you sir.","created_at":"2025-07-26 16:38:15","created_diff":"1 month ago"},{"id":49,"name":"Yemisi Oyeniran","user_ip":"102.89.68.203","content":"Happy birthday to our dear Pastor, Father & Teacher.\nThank you for the impactful words & life sir.\nI wish you sir, more of God's goodness, grace and blessings.\nHave a wonderful birthday celebration sir.","created_at":"2025-07-26 13:05:20","created_diff":"1 month ago"},{"id":46,"name":"Aborisade Oluwadamilola","user_ip":"105.113.58.184","content":"God as help us through his teaching to redirect our part the way a Christian life should be.","created_at":"2025-07-26 12:15:41","created_diff":"1 month ago"},{"id":45,"name":"Aborisade Temitope","user_ip":"105.113.75.41","content":"Happy Birthday to an amazing father, mentor, and pastor. Today marks a special day to celebrate your life, love, and dedication to serving others. Your selflessness, guidance, and kindness have touched countless lives, and we're grateful for your influence.Thank you daddy for giving to the  lord","created_at":"2025-07-26 12:14:33","created_diff":"1 month ago"},{"id":44,"name":"Seun Ogundelu","user_ip":"102.88.111.229","content":"Happy Birthday to an extraordinary servant of God, Professor Gregory Erhabor\n\nYour impact on countless lives, including mine, is immeasurable. As an undergraduate at Obafemi Awolowo University, your teachings and example profoundly shaped my understanding of Christian living, leadership, and purpose. Your passion for Christ and commitment to integrity and hope inspired me.\n\nI cherish memories of listening to your messages at Sanctuary of Hope Church and our personal encounters, including a pivotal moment when you provided guidance and direction during a time of confusion. Your influence has been a blessing, and I'm grateful for the values you've instilled in me.\n\nToday, I celebrate you and pray that God continues to strengthen and guide you. May you finish well, to God's glory. I love and appreciate you, sir.\n\nHappy Birthday, Professor Erhabor, May God bless you abundantly.","created_at":"2025-07-26 11:36:08","created_diff":"1 month ago"},{"id":42,"name":"Emmanuel Alabi and Family","user_ip":"102.89.68.187","content":"Our Dearest Father,\nCongratulations and Happy Birthday!\nWe bless God for your life and all that you do.\nYour life continues to amaze us—marked by humility, patience, and the courage to face the demands of both ministry and your profession.\nYour thoughtfulness is truly remarkable. You remember the little details, and whenever you make a promise, you honor it. What a rare and admirable virtue!\nWe love you deeply and are truly grateful for you.\nMay the Lord continue to keep you, strengthen you, and prosper the work of your hands.\nHappy Birthday, Sir!","created_at":"2025-07-26 10:14:56","created_diff":"1 month ago"},{"id":41,"name":"Ademola AJAYI","user_ip":"102.89.68.176","content":"Happy Birthday to a pragmatic, highly inspiring and compassionate life coach , pastor and mentor.\n\nIts been 13years of getting to know you which has been 13years of great impact and refining in the way of the Lord and rising up to my greatest potential.\n\nWith you as my pastor i know i need to keep raising the bar in excelling in the secular and the sacred and i could not have ask for a better shepherd.\n\nYour daily simple words have been daily calls for action and reflection in a practical manner.\n\nHappy birthday sir, \nI love and appreciate you.","created_at":"2025-07-26 08:28:09","created_diff":"1 month ago"},{"id":39,"name":"Dr. Mankwe Abaram Chesa","user_ip":"102.91.72.51","content":"I am highly delighted to witness this day set aside to celebrate my teacher and mentor.\nI knew him in the course of my residency training and he made a positive impact in my life.\nI love him for his simplicity and kindness to people that come his way\nHappy birthday Sir. May your new age bring forth good tidings and God's choicest blessings \nDr. A. C. Mankwe \nConsultant Physician\/Cardiologist","created_at":"2025-07-26 07:10:07","created_diff":"1 month ago"},{"id":38,"name":"Oswald Zion Onunwa","user_ip":"102.89.68.87","content":"Happy Birthday to an icon who is truly a trailblazer and a transformer. In the short period since joining this great family, Pastor, I have been inspired and motivated to focus on my action plan for Kingdom influence. Dear Pastor, my prayer is that God will keep and preserve you and your family, and cause His face to shine upon you always for good. You will continue to enjoy good health and safety. Happy Birthday once again.","created_at":"2025-07-26 07:06:55","created_diff":"1 month ago"},{"id":37,"name":"EMERIE COLLINS, ILOABUCHI Esq.","user_ip":"197.211.63.5","content":"The calm presence that emits strength which he commands,  reminds me of Isaiah 30:15.\nPastor will always say \"let God be the Boss of your life , my sole administrator\" and as a Young Man, Pastor has taught me how to put God first in everything and watch how everything will work out God's Goodness. It's working for me now and always. He's a beacon of hope in a \nhopeless & chaotic world. I now have hope to live for a better tomorrow. Thank You Sir for giving to the Lord.\nHappy Birthdayyyyy Pastor. Like the path of the just, You shine brighter and brighter. You go from glory to glory and \nfrom strength to strength as you keep appearing before God in Zion. The \nmessage of hope will spread across \nborders and God will keep you for even \nmany more great things ahead. Your \nWife(Our mother in the Lord) is highly blessed and will continually be a great \npillar of support, your children shall \nbecome mighty men and women of Great exploits. As you lead the army, \ntogether we shall take over territories \nfor CHRIST. \n\nBig Big Congratulations Pastor🎉 \nWe will celebrate many more landmark\nbirth anniversaries.Amen.\n\n\n\nWith love from your Son,\nEmerie Collins, Iloabuchi Esq.","created_at":"2025-07-26 06:50:12","created_diff":"1 month ago"},{"id":36,"name":"The Fisusis","user_ip":"105.113.114.183","content":"Thank you, sir, for being a great father, shepherd, mentor and role model to us. Your exemplary life is a shining light in a very dark world. Thank you for showing us through your life that the Word of God is authentic and dependable, and we can actually live out God's Word in this crooked world. Thank you for showing us that it is not just about \"doing your best\" but \"giving it all it takes\" to achieve results. Thank you for consistently showing us that \"it is all about Christ\", not the ephemeral things of this life. Thank you for showing us that it is possible to follow God faithfully and still excel in secular pursuits. Thank you for showing us that the most important thing is to be in the \"centre of God's will\", not just pursuing our own agenda. Thank you for always encouraging us not to settle for the status quo, but to keep growing and getting better each day. Thank you for teaching us not to give up, no matter how intense the opposition or challenge may be. Thank you for teaching us and showing us through your life that with God, all things are possible. Thank you for encouraging us and showing us that the seemingly big goals are achievable and that very tall mountains can be surmounted.\n\nThank you for your kindness and exceptional generosity at all times. Thank you for your counsel and guidance during perplexing times.Thank you for your unwavering love and support over the years. Thank you for always being there for us in difficult seasons of life. Thank you for your gentle correction and compassion when we don't meet up.\n\nAs you begin another year today, may the Lord renew your strength, fill you with a greater measure of His spirit, flood your heart and mind with a greater dimension of wisdom, protect and preserve you and your family everywhere you go, provide everything that you need to do His will in this new season and grant your deepest desires.\n\nHappy birthday, sir!\n\nThe Fisusis","created_at":"2025-07-26 06:02:27","created_diff":"1 month ago"},{"id":35,"name":"Osigbeme Azemobor","user_ip":"102.89.22.152","content":"A father,teacher and mentor filled with  GOD'S revelational wisdom .Sir, may the GOOD GOD continue to bless with more wisdom.","created_at":"2025-07-26 04:45:03","created_diff":"1 month ago"},{"id":34,"name":"Opadare Sunday","user_ip":"102.89.68.191","content":"Happy birthday sir, We are so grateful for your dedication and the positive impact you have on our lives. Thank you for your guidance and leadership. May God bless you with a wonderful year ahead","created_at":"2025-07-26 04:25:13","created_diff":"1 month ago"},{"id":33,"name":"Oluwaseun Peter Bamidele","user_ip":"41.150.49.48","content":"\"Don't put full stop in your life where God place a comma\".\n\"There is no dichotomy between the spiritual and the physical\".\nHappy Birthday, Daddy. More grace, anointing and power in Jesus's name. Long life and prosperity in Jesus's name.","created_at":"2025-07-25 23:58:34","created_diff":"1 month ago"},{"id":32,"name":"Atinuke Bamidele","user_ip":"102.89.83.237","content":"Pleasant birthday wishes to my dear pastor, mentor and coach. You have touched my life in so many ways, helping me to become a better version of myself. I have learnt that as a servant leader, I should not claim any right over anything in this life. Your words keep ringing, ' Here goes I, if not for the grace of God'. You have taught me to pour grace ahead of offences. I have learnt and experienced your words; that undeserved suffering is redemptive . These and so many other lessons from you have continued to shape and transform my life. Thank you so much sir for being part of my milestones, thank you sir for your prayers and thank you sir for leading me in the way of Christ. On this occasion of your birthday, I pray for more grace, more anointing, more wisdom, more unction to function and renewed strength, all the days of your life, in Jesus mighty name!","created_at":"2025-07-25 23:17:04","created_diff":"1 month ago"},{"id":31,"name":"Akinkunmi and Oluwatoyin Famojuro","user_ip":"105.113.109.138","content":"We wish our dear Pastor Rev'd Prof Greg Erhabor a glamourous birthday 🎂, we celebrate you sir, you have been an inspiration to us, we have learnt so many things from your words and messages which had helped sharpened our lives, strengthened our marriage. \nEver since we walked into SSOHC, it has been impartation roundabout, you taught us Patience, Calmness, Forgiveness, Giving, Faith, Leadership and importantly dwelling on the Word of GOD.\nWe are so blessed by you. We pray God bless you, strengthen and energizes you with more power and anointing. Amen\nLooking forward to greater years with you. \nThank you sir","created_at":"2025-07-25 22:54:17","created_diff":"1 month ago"},{"id":30,"name":"David and Lydia SANNI","user_ip":"102.91.77.85","content":"Happy Birthday dear Pastor. In our family, we refer to him not just as our Pastor but as the 'Spokesman' for us. Several lessons have been learnt as a family and as individuals,to put them into words would be incomplete, and words cannot fully express them. His messages are timely, his love is palpable any time. His personality carries the presence of God. He will ask, \"Anything new?\" We knew he was talking about hearing from God. His teaching on salvation, and life matters would simply put you to lay your ears to feel the heartbeat of God and follows his instruction at all times. His drive for excellence is helping us in our career, as a guide, we have come to know that as Pastor will not take anything less than excellent, we too should follow as such. Another lesson is \"take it cool\" when you are not getting results, stop, restrategize and go again, and results will come up. Our prayer is that God continually honour him with wisdom, strenght, open doors, and greater anoinoiting. Happy birthday Daddy, the SPOKESMAN for our generation and even for the generation to come.","created_at":"2025-07-25 21:50:23","created_diff":"1 month ago"},{"id":29,"name":"Emem-Obong Odu","user_ip":"102.89.83.178","content":"Number one ingredient in marriage -Patience.\nNumber one ingredient for business- Prioritize  and delegate .Set goals for the day\/week\/ and this will make for the months and the year, giving you an efficiently productive year! I virtually think “ how my pastor will feel if he hears this or sees this” before I decide on doing many things in my life. For 15 years now. He has been my mentor and influencer. In every aspect of my life. He is an example to emulate after Christ!! I pray that God makes you very happy and joyful on this day of your birthday!! That God will cause you to live long , you and mummy and withness many many good things of this life and your grand grand children will surround your table!! In Jesus name!! Thank you for giving to the Lord","created_at":"2025-07-25 21:30:45","created_diff":"1 month ago"},{"id":28,"name":"Ayokunle Lawal","user_ip":"102.89.83.97","content":"Discretion is a powerful tool of greatness.\n Learn to be constructive and not instructive.\nEverything you need is in God. When you discover God, you discover all.\nThe secret of greatness is moving forward. Dwelling on the past is retrogression.\nLearn to run your race. Don't be in competition with anyone.\nI can go on and on.\n\nSir, I encountered your teachings exactly one year ago and it has been a very impactful journey of inspiration, direction and the will to keep on with the things God has put in my mind.\nThank you sir for being a mentor and coach. May God increase you in His wisdom and knowledge as you celebrate in Jesus name 🙏.\nHappy birthday sir. More grace.","created_at":"2025-07-25 21:17:07","created_diff":"1 month ago"},{"id":27,"name":"Bolade Josephine Oluwabusolami","user_ip":"102.89.83.123","content":"I am grateful to God for preserving and sustaining you in his will Pastor sir. My greatest joy is that you do not only know God yesterday, but the pursuit continues daily. That has always been the real deal for me. The greatest lesson for me has been the teachings on pulling through in difficult times. God truly ordered my steps to SSOH to learn that and it is a lesson well learnt! Thank you for being a blessing and always encouraging us to do better, because you see the best in us. \nIn this new year, I pray that you enjoy all that God has for you, sir. Your faith is stronger, and your love is deeper. There is no better yesterday for you because you are continually refreshed by the Lord. HAPPY BIRTHDAY TO YOU DADDY!!! Welcome to a refreshing season.","created_at":"2025-07-25 19:56:23","created_diff":"1 month ago"},{"id":26,"name":"Hamilton-Scott Tolulope","user_ip":"102.89.83.161","content":"Happy Birthday, Rev’d Prof. Gregory Efosa Erhabor. Sir, today I celebrate not just your Birthday, but the blessing your life has been, to me and to many others. You have been a true pastor, a good father, and an inspiring leader. But beyond all these, you have been a man of deep generosity, and strength. Your lifestyle of integrity, and excellence has challenged me to live more intentionally. The way you give is outstanding. You do not  just preach, You are an example of what you preach. I am grateful to be one of the many impacted. May God continue to bless you with long life, peace of mind and showers of blessings.","created_at":"2025-07-25 19:56:17","created_diff":"1 month ago"},{"id":25,"name":"Afolabi Damilola Cephas","user_ip":"102.89.82.214","content":"3 years and counting of being under his mentorship, I have experienced spiritual, intellectual, emotional growth and growth in several other areas. \n\nRev. Prof. Gregory Erhabor is a Father indeed who shows CONSISTENT support, emphasis on \"consistent.\" I don't think I've met a human who is as consistent as he is. \n\nAll these years of listening to God's Word from him, years of listening to his counsel in those \"off-camera\" meetings, years of learning to follow instructions even when you don't fully understand it... Have groomed me. \n\nI'm grateful to have met and known such a wonderful Father and Pastor. \n\nAll glory to God for keeping you strong in health and faith sir. \nThank you for giving to the Lord sir. \n\nHAPPY HAPPY HAPPY BIRTHDAY TO YOU SIR.🥳🥳\nI bless the day I met you sir. \n\nIn this newly added year, the Lord gives you greater unction, strength, wisdom, power and grace sir. \nThe Good Lord bless you sir. \n\nWe love you sir. ❤️","created_at":"2025-07-25 19:48:13","created_diff":"1 month ago"},{"id":24,"name":"Olayanju Hephzibah","user_ip":"197.211.63.4","content":"Happy Birthday, Pastor\nOn this special day, i celebrate not just your birth, but the gift of your life and leadership. Your unwavering dedication, spiritual wisdom, and Christlike love have deeply impacted our lives and strengthened the church.\nI pray that God continues to renew your strength, enlarge your territory, and bless you with long life, peace, and divine favor.\nMay this new year bring greater anointing, uncommon testimonies, and joy beyond measure.\nHappy Birthday REV. PROF. GREGORY ERHABOR.","created_at":"2025-07-25 16:40:59","created_diff":"1 month ago"},{"id":23,"name":"Sharon Igbinoba","user_ip":"102.88.109.236","content":"Happy birthday to our beloved Pastor, Rev. Prof Greg Erhobor. As I reflect on your special day, I am filled with gratitude for the way you have answered God's call on your life. Your ministry has profoundly impacted my life in every area, and I am thankful for the godly examples you have set. Your life testifies that faith anchored in God is unshakeable, and that patience yields divine rewards. I pray that the coming years will unlock new doors of ministry opportunities, expanding your impact and influence for the glory of God in Jesus name","created_at":"2025-07-25 16:09:18","created_diff":"1 month ago"},{"id":22,"name":"Ethan Miles","user_ip":"102.89.69.101","content":"Happy Birthday, Rev’d Prof. Gregory Efosa Erhabor!\n\nSir, today I celebrate not just the day you were born, but the gift your life has been, to me and to countless others. You have been a true pastor, a wise teacher, a steady mentor, and an inspiring leader. But beyond all these roles, you have been a man of deep generosity, unwavering principle, and quiet strength.\n\nYour lifestyle, marked by discipline, integrity, and excellence, has challenged me to live more intentionally. The way you give, not just financially but of your time, wisdom, and heart, is a standard that speaks volumes. You don’t just preach values; you embody them. And your marriage has been a profound example of partnership, honor, and kingdom alignment. Watching you and your wife serve together in unity has expanded my understanding of what a godly marriage can and should look like.\n\nThank you for leading with humility, for giving so selflessly, and for inspiring a generation, including me, to walk worthy of their calling. May God continue to bless you with long life, good health, divine insight, and joy that overflows. The legacy you’re building is eternal, and I am grateful to be one of many impacted by it.\n\nWith deep honor and heartfelt gratitude\nOlabode Olaniyi Bolaji","created_at":"2025-07-25 15:02:51","created_diff":"1 month ago"},{"id":21,"name":"Hon Patrick Patken","user_ip":"102.89.69.127","content":"LESSONS LEARNT FROM OUR DEAR PASTOR, SHEPHERD, FATHER AND EXTRAORDINARY LEADER.\n\n1. Selflessness In Service: Our dear Pastor has shown us that true leadership is not necessarily about authority but about serving others with humility and compassion. His willingness to put the needs of others first has set a standard we aspire to follow.\n\n2. Dedication Beyond ordinary: Through challenges and triumphs, our Pastor has demonstrated relentless commitment to his God's given mission. Your perseverance reminds us that excellence is not an accident but the result of intentional effort and steadfast resolve.\n\n3. Excellence Rooted In Purpose: Each endeavour undertaken by our Daddy reflects a pursuit of excellence, clearly not for personal gains but for a higher purpose. He has taught us that once our work aligns with faith and conviction, even the smallest tasks leads to both earthly and eternal significance.\n\n4. God Centered Leadership: Our Pastor has exemplified what it means to lead with the foundation based on faith.  His dependence on God's guidance, coupled with a heart of gratitude and prayer has always reminded us that true success is built on spiritual wisdom and divine direction.\n\n5. Inspiration By Example: I have learnt that great leaders do not just give instructions; they inspire through their characters. Our Pastor's integrity, kindness and unwavering moral compass have shown us how to lead with wisdom and grace.\nCONCLUSION: \nLet us honour the legacy of our dear Pastor by embodying these same principles of service, dedication and faith in all that we do. I pray we continue to be inspired by his example and strive to make a meaningful difference in our world.\nThank you Sir.","created_at":"2025-07-25 14:56:42","created_diff":"1 month ago"},{"id":20,"name":"Virtue Ilesanmi","user_ip":"105.113.71.166","content":"Happy belated birthday pastor. Thank you for your outpour of love, wisdom and kindness. God bless your new age sir in Jesus name","created_at":"2025-07-25 14:28:09","created_diff":"1 month ago"},{"id":18,"name":"Abiola Emordi","user_ip":"105.113.91.11","content":"Dear Pastor, on this ocassion of your birthday I want to thank God for your life and tell you how grateful I am to God for letting me know you. When I came to Ife, I was coming from Lagos so I just didn't find the right Church, it seemed most people built their Churches according to the standard in the environment here, no excellence, just ordinary but on a certain day, someone told me about this Church and I decided to try and what I saw was just what I needed, the word was it, the environment of the Church was speaking excellence in short I found the place. Getting to know you as a Pastor and father too has been so awesome, You bring yourself to the people and ive learnt a lot from you. Your Humility is unbelievable, your heart of giving is second to none. Your servant heart is another thing I admire about you. I want to say thank you sir for giving to the Lord, I am a life that was changed. Happy birthday Pastor","created_at":"2025-07-25 14:04:06","created_diff":"1 month ago"},{"id":17,"name":"Hon Patrick Patken","user_ip":"102.89.69.127","content":"Dear Sir, \nOn this special day, we celebrate you not just as an exceptional father but as an inspiring shepherd whose vision, dedication and unwavering commitment to selflessness helps us to navigate through thick and thin.\nYour teachings, shepherding and guidance has been a beacon of strength, motivating us to strive for excellence, and we are deeply grateful.\nWe pray this day bring you joy, good health, long life and many happy returns. \nWishing you a wonderful celebration and a fantastic year ahead.","created_at":"2025-07-25 14:02:40","created_diff":"1 month ago"},{"id":16,"name":"Okhiokpamwonyi silas","user_ip":"197.211.57.0","content":"I have leant to give peace a chance in my home ND all aspects of my life...God bless you for all you have teaches us all through the years ...I wish you happy birthday full of God's power ND blessings..much love sir.","created_at":"2025-07-25 14:01:49","created_diff":"1 month ago"},{"id":14,"name":"Amowogbaje Catherine Chinyere","user_ip":"102.88.109.59","content":"Happy birthday Pastor, wishing you long life and greater prosperity.  Thank you for always teaching us to look up to God.","created_at":"2025-07-25 13:37:33","created_diff":"1 month ago"},{"id":13,"name":"Gideon Amowogbaje","user_ip":"102.88.109.59","content":"Happy Birthday Sir, your life had been a tremendous blessing to me. The fact you are always progressive, your sincerity and honesty is a big call out. Listening to your stories, being under your teachings have done something to me and is still doing something to me.","created_at":"2025-07-25 13:30:30","created_diff":"1 month ago"},{"id":12,"name":"Adeolu Morawo","user_ip":"97.179.134.74","content":"Happy Birthday, Pastor!\nThank you for your unwavering love, care, and mentorship through the years. You've guided me spiritually and academically, and your shepherding has been pivotal during key turning points in my life: choosing a life partner, discovering my love for reading, traveling to the U.S. for graduate school, and transitioning back into clinical practice. I’ll never forget your practical help when I was stuck in Nigeria due to visa issues.\nThank you for believing in me and creating countless opportunities to grow and sharpen both my spiritual and intellectual gifts. You've shown me how these two dimensions can be powerfully woven together. Your life continues to inspire me; an example of excellence, resilience, and relentless progress.\nMay your new year be filled with greater strength and deeper glory.","created_at":"2025-07-25 10:55:26","created_diff":"1 month ago"},{"id":11,"name":"Rev God-dey Ikekhuah","user_ip":"102.89.68.35","content":"Happy birthday Prof. Very Special and deeply warm congratulations.\nOver the years, your resolute focus on sincere service to God and building the church with deep scriptural and life applicable inspiring truths remains heart warming. Please keep on this noble and sacred path you chose to follow over half a century ago. The king has a great reward for you.  \nCheers and God bless you.","created_at":"2025-07-24 23:27:27","created_diff":"1 month ago"},{"id":10,"name":"Godknows Osarhiaekhimen","user_ip":"102.91.5.240","content":"The first time I attended Sanctuary of Hope Church, I was struck by how practical the sermons were without neglecting the central focus on Christ. As time went on, I was privileged to sit under Prof. Erhabor 's tutelage as a medical student, and as a mentee, eventually. I have received practical insights that are currently shaping my career trajectory, wisdom that has improved my walk with God, and guidance to face life with unrelenting fervour. As Prof. Erhabor clocks another year in a few days, I pray that he continues to have transgenerational impact and that God continues to give him avenues to raise a new breed of leaders in various spheres of society. And, most importantly, when God calls him home if Jesus tarries, may he be welcomed home with \"Well done, my good and faithful servant\", in Jesus' name.","created_at":"2025-07-24 11:27:43","created_diff":"1 month ago"},{"id":9,"name":"Folahan Ibukun","user_ip":"174.172.90.148","content":"It is a privilege to have been taught by Prof. Erhabor. His warmth and accommodation are unparalleled. Wishing Prof. Erharbor many more celebrations in good health of mind and body.","created_at":"2025-07-24 01:39:51","created_diff":"1 month ago"},{"id":7,"name":"Folasade Lawal","user_ip":"75.159.130.199","content":"I learnt commitment to divine assignment","created_at":"2025-07-23 17:10:43","created_diff":"1 month ago"},{"id":6,"name":"Bamidele Adeniyi","user_ip":"78.150.70.252","content":"Happy birthday to an Icon , an academic doyen and a spiritual giant in our generation . Sir, You have continued to be a source of inspiration and hope to many. \nWe are thankful for the lessons you have taught us , the life of christ you have modeled and the fatherly love you have demonstrated to us. \nMy family and I are grateful for your impact and mentorship over our lives over the years. \nWe have learnt the wisdom of a quiet and calm disposition; never to lose our head in any circumstance . We have learnt to take responsibility and not blame others for our lives and much more importantly we have learnt the power of never giving up and an excellent attitude in all we do. \nAs you clock another year Sir, may your strength be continually renewed and may your impact continue to transcend generations .\nWith much love and regards ,\nBisola , Dele, John , Favour and Joyce \nADENIYI.","created_at":"2025-07-23 16:33:46","created_diff":"1 month ago"},{"id":5,"name":"Dr. Oludare Anuodo","user_ip":"148.252.146.72","content":"In 2012, after my return to Ile-Ife, Nigeria, from China, a decision that stands out above all others was joining the Sanctuary of Hope. This wasn't just a choice of affiliation; it was an opening to your wisdom and guidance, which has profoundly shaped me. \n\nThe growth I've experienced across all facets of my life since then is a direct testament to your influence. Even now, settled in the UK since 2022, your messages remain a foundational pillar in my daily application of faith and life principles. Though I'm still striving towards my ultimate goals, the journey thus far has been one of remarkable transformation, all thanks to your teaching and unwavering prayers.\n\nOn this special day, my wife Ajibike, our daughter Ooreofe, and our son Obafemi join me in extending our warmest birthday wishes, sir. We pray for your continued long life, robust health, and a sharp, sound mind.","created_at":"2025-07-23 10:55:27","created_diff":"1 month ago"},{"id":4,"name":"Dare Ashaolu","user_ip":"185.241.224.135","content":"Happy Birthday, Pastor!\n\nYou are a true and worthy mentor, and over the years, I have followed your teachings both actively and passively. You have taught me not to underestimate the power of small beginnings and have opened my mind through a practical step-by-step approach on how to break into the global stage by walking the talk. You encourage me to aim high and far. \n\nI cannot overlook your disciplined lifestyle, a characteristic I deeply admire and strive to emulate. May grace continue to abound for you in all aspects of life and godliness, in Jesus' name.","created_at":"2025-07-23 08:35:46","created_diff":"1 month ago"},{"id":3,"name":"Ayamasaowei Eunice","user_ip":"102.91.105.224","content":"Happy birthday Daddy!! It’s been years and I still remember your words of wisdom on giving, excellence and other aspects of life, shaping my conduct with people. Truly you inspire me. May God continually keep you fresh and seasoned. Grant you grace and mercy continuously for your new age. Amen and thank you so much Sir for being a blessing to this generation.","created_at":"2025-07-23 08:21:28","created_diff":"1 month ago"},{"id":2,"name":"Bolade Abraham","user_ip":"102.89.32.196","content":"Happy Blessed Birthday Pastor!, am so opportuned to be under your mentorship and tutorship. Your words of encouragement and the messages from God has transformed my life powerfully.\n• I have learnt to have a personal relationship with God and to fellowship with him continually.\n• I have learnt to be still and acknowledged the presence of God in every situation I find myself.\n• I have learnt to embrace the \"Never Give Up Spirit\".\n• I have learnt to take a step of faith and trust God for intervention over every areas of my life.\n• I have learnt to never be ungrateful to God no matter what happens.\n    So much I have learnt pastor, whenever am in the presence of God and you come up to speak to us. I am always blessed. It is as if God intentionally give you those words for the situation I found myself.\n\n   May the Lord continually strengthen you and give you a gift. Thank you pastor for everything.","created_at":"2025-07-23 07:38:49","created_diff":"1 month ago"},{"id":1,"name":"Ajibola Oyetola","user_ip":"102.89.34.154","content":"Happy Birthday Pastor!\nI’m deeply grateful to God for your life and the grace upon your ministry. How blessed I am to have passed through your teachings in Ife and beyond.\nYour words not only shaped my spiritual growth but also taught me practical wisdom and leadership that helped me navigate tough decisions, stay grounded, and walk in purpose.\nThank you for being a vessel of truth and encouragement. Your consistency, humility, and heart for God are lessons I will carry with me always.\nMay God bless you richly in this new year of your life, and may your impact continue to grow across generations.","created_at":"2025-07-22 22:52:55","created_diff":"1 month ago"}]}